# Определить, какие из слов «attribute», «класс», «функция», «type» невозможно записать в
# байтовом типе.

print('Слова, написанные не на латинице невозможно записать в байтовом типе - это вызовет ошибку')
print('Ответ: "класс", "функция"')
